cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'wget'
brew 'yt-dlp'
brew 'ffmpeg'
brew 'neovim'
brew 'fzf'
brew 'ripgrep'
brew 'lua-language-server'
brew 'vscode-langservers-extracted'
brew 'pyright'
brew 'ruff'
brew 'stylua'
brew 'markdownlint-cli2'
brew 'markdown-oxide'
brew 'rust-analyzer'
# toml formatter
brew 'taplo'

cask 'discord'
cask 'docker'
cask 'google-chrome'
cask 'telegram'
cask 'typefully'
cask 'vlc'
cask 'whatsapp'
cask 'zoom'
cask 'expressvpn'
cask 'screen-studio'

