cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'wget'
brew 'yt-dlp'
brew 'ffmpeg'
brew 'neovim'
brew 'fzf'
brew 'ripgrep'
brew 'lua-language-server'

cask 'discord'
cask 'docker'
cask 'google-chrome'
cask 'telegram'
cask 'typefully'
cask 'vlc'
cask 'whatsapp'
cask 'zoom'
cask 'expressvpn'

