cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'biome'
brew 'echidna'
brew 'ffmpeg'
brew 'fzf'
brew 'gh'
brew 'gnupg'
brew 'go'
brew 'gpg2' 
brew 'graphviz'
brew 'imagemagick'
brew 'keyring'
brew 'lua-language-server'
brew 'markdown-oxide'
brew 'markdownlint-cli2'
brew 'neovide'
brew 'neovim'
brew 'ollama'
brew 'opencode'
brew 'pinentry-mac'
brew 'pyright'
brew 'ripgrep'
brew 'ruff'
brew 'rust-analyzer'
brew 'solc-select'
brew 'solidity'
brew 'stylua'
brew 'tailwindcss-language-server'
brew 'taplo' # toml formatter
brew 'tree'
brew 'twine'
brew 'typescript-language-server'
brew 'uv'
brew 'vscode-langservers-extracted'
brew 'wget'
brew 'yt-dlp'

cask 'discord'
cask 'docker-desktop'
cask 'expressvpn'
cask 'figma'
cask 'figma@beta'
cask 'google-chrome'
cask 'raycast'
cask 'screen-studio'
cask 'telegram'
cask 'typefully'
cask 'vlc'
cask 'whatsapp'
cask 'zoom'
